; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph2 - mode
	thermograph0 - mode
	image1 - mode
	infrared6 - mode
	image3 - mode
	image7 - mode
	infrared4 - mode
	thermograph5 - mode
	GroundStation5 - direction
	GroundStation7 - direction
	Star0 - direction
	Star3 - direction
	Star6 - direction
	GroundStation1 - direction
	Star4 - direction
	Star2 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 image1)
	(supports instrument1 image7)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph5)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 infrared6)
	(supports instrument3 image3)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(have_image Phenomenon8 image3)
	(have_image Phenomenon8 infrared4)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon9 image3)
	(have_image Star10 infrared4)
	(have_image Star10 thermograph5)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 thermograph5)
	(have_image Phenomenon12 image7)
))

)

; plan
1. (turn_to satellite1 star2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star2)
   goals met: 0 of 9
2. (turn_to satellite0 star3 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star3)
   goals met: 0 of 9
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
4. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 9
5. (turn_to satellite0 phenomenon12 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 9
6. (take_image satellite0 phenomenon12 instrument1 image7)
   added: (have_image phenomenon12 image7)
   goals met: 1 of 9
7. (turn_to satellite0 groundstation7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation7)
   goals met: 1 of 9
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 9
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
11. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 1 of 9
12. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 1 of 9
13. (turn_to satellite0 phenomenon9 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 9
14. (take_image satellite0 phenomenon9 instrument0 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 2 of 9
15. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 2 of 9
16. (take_image satellite0 planet11 instrument0 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 3 of 9
17. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 9
18. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 9
19. (turn_to satellite0 groundstation1 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 9
20. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 3 of 9
21. (turn_to satellite0 phenomenon12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 9
22. (take_image satellite0 phenomenon12 instrument2 thermograph5)
   added: (have_image phenomenon12 thermograph5)
   goals met: 4 of 9
23. (turn_to satellite0 phenomenon8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 9
24. (take_image satellite0 phenomenon8 instrument2 infrared4)
   added: (have_image phenomenon8 infrared4)
   goals met: 5 of 9
25. (turn_to satellite0 star10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star10)
   goals met: 5 of 9
26. (take_image satellite0 star10 instrument2 infrared4)
   added: (have_image star10 infrared4)
   goals met: 6 of 9
27. (take_image satellite0 star10 instrument2 thermograph5)
   added: (have_image star10 thermograph5)
   goals met: 7 of 9
28. (turn_to satellite1 phenomenon8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon8)
   goals met: 7 of 9
29. (take_image satellite1 phenomenon8 instrument3 image3)
   added: (have_image phenomenon8 image3)
   goals met: 8 of 9
30. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   goals met: 8 of 9
31. (take_image satellite1 phenomenon9 instrument3 image3)
   added: (have_image phenomenon9 image3)
   goals met: 9 of 9
